espressif/esp-gmf/elements/gmf_ai_audio/examples/wwe/sdkconfig.defaults.esp32
CONFIG_IDF_CMAKE=y
CONFIG_IDF_TARGET_ARCH_XTENSA=y
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0000

CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_8M.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_8M.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xA000
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table

CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_SPEED=80

#
# ESP Speech Recognition
#
CONFIG_AFE_INTERFACE_V1=y
CONFIG_SR_NSN_WEBRTC=y
CONFIG_SR_VADN_WEBRTC=y

#
# Load Multiple Wake Words
#
CONFIG_SR_WN_WN9_HILEXIN=y

CONFIG_SR_MN_CN_NONE=y
# CONFIG_SR_MN_CN_MULTINET2_SINGLE_RECOGNITION is not set
CONFIG_SR_MN_EN_NONE=y
# end of ESP Speech Recognition

#
# GMF AI Audio
#
CONFIG_GMF_AI_AUDIO_INIT_AFE=y
CONFIG_GMF_AI_AUDIO_INIT_AEC=n
CONFIG_GMF_AI_AUDIO_INIT_WN=n
CONFIG_GMF_AI_AUDIO_INIT_VAD=n
CONFIG_GMF_AI_AUDIO_INIT_NS=n
CONFIG_GMF_AI_AUDIO_INIT_DOA=n

CONFIG_GMF_AI_AUDIO_AFE_VAD_ENABLE=y
CONFIG_GMF_AI_AUDIO_VAD_MODE=3
CONFIG_GMF_AI_AUDIO_WAKEUP_ENABLE=y
CONFIG_GMF_AI_AUDIO_AEC_INPUT_SAMPLING_RATE_8K=y
CONFIG_GMF_AI_AUDIO_AEC_CH_ALLOCATION="RM"
CONFIG_GMF_AI_AUDIO_WN_CH_ALLOCATION="RM"
CONFIG_GMF_AI_AUDIO_AFE_CH_ALLOCATION="RM"

# end of GMF AI Audio
